app/controllers/books_controller.rb

    def index
      #@books = Book.where(login_userId: current_user.id)
      @books = Book.all
---
SELECT "books".* FROM "books"

    def create
       @book = Book.new(book_params)
       #@book = Book.new(title: params[:title],author: params[:author],login_userId: current_user.id)
       if @book.save
---
INSERT INTO "books" ("title", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "蜘蛛の糸"], ["author", "芥川龍之介"], ["created_at", "2023-02-06 05:43:31.767675"], ["updated_at", "2023-02-06 05:43:31.767675"]]

    def update
        @book = Book.find(params[:id],current_user.id)
        if @book.update(book_params)
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "author" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["author", "辰野金吾"], ["updated_at", "2023-02-06 06:07:02.505967"], ["id", 1]]